# Introduction to pandas
1. Creating a DataFram
2. Selecting columns & rows from a DataFrame
3. Calculate aggregations/descriptive statistics
4. Grouped calculations

## The Basics

In [2]:
import pandas as pd

### Create a pandas DataFrame

In [4]:
d ={'a':1, 'b':2, 'c':3}
d['b']

2

In [12]:
df = pd.DataFrame({
    'eye': ['brown' , 'green' , 'blue', 'blue'  , 'brown' , 'brown'],
    'hair': ['brown', 'blonde', 'red' , 'blonde', 'brown' ,  'blue'],
    'height': [60   ,  72     , 62    , 65      ,  80     ,      74],
})

# print (df) #Jupter will display the last line of your cell!
df

     eye    hair  height
0  brown   brown      60
1  green  blonde      72
2   blue     red      62
3   blue  blonde      65
4  brown   brown      80
5  brown    blue      74

### Selecting Columns & Rows

In [15]:
df.dtypes #returns the col and its data type

#dataframe rn just holding the data

eye       object
hair      object
height     int64
dtype: object

In [16]:
df['height'] # single col

0    60
1    72
2    62
3    65
4    80
5    74
Name: height, dtype: int64

In [18]:
df[['height', 'eye']] # select multiple cols

   height    eye
0      60  brown
1      72  green
2      62   blue
3      65   blue
4      80  brown
5      74  brown

#### Comparators
- Less than `<`
- Greater than `>`
- Less or equal to `<=`
- Greater or equal to `>=`
- Equal to `==`
- Not equal to `!=`

In [19]:
df['eye'] #returns the value of eye column
df['eye'] == 'brown' #returns a boolean array

0     True
1    False
2    False
3    False
4     True
5     True
Name: eye, dtype: bool

In [20]:
df['height'] == 60

0     True
1    False
2    False
3    False
4    False
5    False
Name: height, dtype: bool

In [21]:
df['height'] < 70

0     True
1    False
2     True
3     True
4    False
5    False
Name: height, dtype: bool

In [22]:
 # df.loc[] # selecting rows with specific criteria
 df.loc[df['height']<=70] # filtering on a boolean criteria

     eye    hair  height
0  brown   brown      60
2   blue     red      62
3   blue  blonde      65

In [23]:
df.index #shows index

RangeIndex(start=0, stop=6, step=1)

In [24]:
df.loc[df['height']<=70].index

Index([0, 2, 3], dtype='int64')

#### Additional Logical Operators
- And `&`
- Or `|`

In [25]:
#Multiple criteria example
(df['eye'] == 'brown') & (df['height'] <= 70)

0     True
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [27]:
#Multiple criteria example
(df['eye'] == 'brown') | (df['height'] <= 70)

0     True
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [26]:
#Multiple criteria example
df.loc[(df['eye'] == 'brown') & (df['height'] <= 70)]

     eye   hair  height
0  brown  brown      60

In [28]:
#Multiple criteria example
df.loc[(df['eye'] == 'brown') | (df['height'] <= 70)]

     eye    hair  height
0  brown   brown      60
2   blue     red      62
3   blue  blonde      65
4  brown   brown      80
5  brown    blue      74

### Calculations

#### Numerical

- Addition `+`
- Subtraction `-`
- Division `/`
- Multiplication `*`
- Raising to a power `**`

#### Aggregations

- Max value `.max()`
- Min value `.min()`
- Mean `.mean()`
- Median `.median()`
- Quantile `.quantile([.25, .5, .75])`
    - shows what value falls in the different quartiles
- Standard Deviation `.std(ddof=1)`

In [29]:
df['height'] + 20

#Cannot add values to the whole data frame unless all values are int type

0     80
1     92
2     82
3     85
4    100
5     94
Name: height, dtype: int64

In [30]:
df .select_dtypes('number') #will show only colums that are all that data type

   height
0      60
1      72
2      62
3      65
4      80
5      74

In [33]:
#Adding units

df['height'].astype(str) + [' inches'] #converts the col into a string or object type

0    60 inches
1    72 inches
2    62 inches
3    65 inches
4    80 inches
5    74 inches
Name: height, dtype: object

In [34]:
#Aggregators; Use the call functions above and follwo the example

df['height'].median()

68.5

### Group Calculations

In [35]:
df.groupby('eye')['height'].mean()

eye
blue     63.500000
brown    71.333333
green    72.000000
Name: height, dtype: float64

## Applied to FRED

### Load Data From FRED

In [38]:
from fredapi import Fred
fred = Fred(api_key='8f59dec25e3eb3275581b6d50ddbc63b')

oecd_series = fred.get_series('SPASTT01USM661N', observation_start='1960-01-01', observation_end='2023-07-01')

oecd_series

1960-01-01      3.418156
1960-02-01      3.255919
1960-03-01      3.205570
1960-04-01      3.233542
1960-05-01      3.205570
                 ...
2023-03-01    141.134556
2023-04-01    145.176059
2023-05-01    142.583249
2023-06-01    145.834377
2023-07-01    150.752045
Length: 763, dtype: float64

In [39]:
cpi_series = fred.get_series('CPIAUCSL', observation_start='1960-01-01', observation_end='2023-07-01')

cpi_series

1960-01-01     29.370
1960-02-01     29.410
1960-03-01     29.410
1960-04-01     29.540
1960-05-01     29.570
               ...
2023-03-01    301.808
2023-04-01    302.918
2023-05-01    303.294
2023-06-01    303.841
2023-07-01    304.348
Length: 763, dtype: float64

In [45]:
fred_df = pd.DataFrame({
    'OECD': oecd_series,
    'CPI' : cpi_series
})

fred_df

                  OECD      CPI
1960-01-01    3.418156   29.370
1960-02-01    3.255919   29.410
1960-03-01    3.205570   29.410
1960-04-01    3.233542   29.540
1960-05-01    3.205570   29.570
...                ...      ...
2023-03-01  141.134556  301.808
2023-04-01  145.176059  302.918
2023-05-01  142.583249  303.294
2023-06-01  145.834377  303.841
2023-07-01  150.752045  304.348

[763 rows x 2 columns]

In [47]:
fred_df.loc['2007-01-01'] #Year Month Date

OECD     85.537193
CPI     203.437000
Name: 2007-01-01 00:00:00, dtype: float64

In [49]:
fred_df.loc['2007-01-01']['CPI'] #Instead of returning a series it returns only the value paired with CPI

203.437

In [51]:
fred_df['CPI'] / fred_df.loc['2007-01-01']['CPI']

1960-01-01    0.144369
1960-02-01    0.144566
1960-03-01    0.144566
1960-04-01    0.145205
1960-05-01    0.145352
                ...
2023-03-01    1.483545
2023-04-01    1.489002
2023-05-01    1.490850
2023-06-01    1.493539
2023-07-01    1.496031
Name: CPI, Length: 763, dtype: float64

In [55]:
#Making a new column in pandas

fred_df['CPI_adj'] = 1

fred_df

                  OECD      CPI  CPI_adj
1960-01-01    3.418156   29.370        1
1960-02-01    3.255919   29.410        1
1960-03-01    3.205570   29.410        1
1960-04-01    3.233542   29.540        1
1960-05-01    3.205570   29.570        1
...                ...      ...      ...
2023-03-01  141.134556  301.808        1
2023-04-01  145.176059  302.918        1
2023-05-01  142.583249  303.294        1
2023-06-01  145.834377  303.841        1
2023-07-01  150.752045  304.348        1

[763 rows x 3 columns]

In [56]:
fred_df['CPI_adj'] = fred_df['CPI'] / fred_df.loc['2007-01-01']['CPI']

fred_df

                  OECD      CPI   CPI_adj
1960-01-01    3.418156   29.370  0.144369
1960-02-01    3.255919   29.410  0.144566
1960-03-01    3.205570   29.410  0.144566
1960-04-01    3.233542   29.540  0.145205
1960-05-01    3.205570   29.570  0.145352
...                ...      ...       ...
2023-03-01  141.134556  301.808  1.483545
2023-04-01  145.176059  302.918  1.489002
2023-05-01  142.583249  303.294  1.490850
2023-06-01  145.834377  303.841  1.493539
2023-07-01  150.752045  304.348  1.496031

[763 rows x 3 columns]